{
  "articles": [
    {
      "id": 1,
      "content": "Я придумал как и куда складывать свои мысли.\n\nДавно хотел, даже начинал, только подход был неправильный. Все движки для блогов мне кажутся неполноценными (я программист). А свой писать - дофига сложно/нет времени/оно того не стоит.\n\nНаконец-то я нашел выход. Есть такие программерские принципы:[KISS](https://ru.wikipedia.org/wiki/KISS_(принцип)) и [YAGNI](https://ru.wikipedia.org/wiki/YAGNI), весьма помогают в работе, оберегают от безумных решений. Первый расшифровывается как «keep it simple stupid», это значит «не усложняй», а второй как «you ain't gonna need it» — «тебе это не понадобится»\n\nТак вот, мне пока ничего не надо, кроме как записать пару строчек и я решил не усложнять.",
      "date": "2017-08-04",
      "header": "Привет"
    },
    {
      "id": 2,
      "content": "Добавил немного цивилизации в [свое приложение](http://github.com/gleb-lobastov/mine). Теперь оно работает на [реакте](https://facebook.github.io/react).\n\nВнешне ничего не именилось, зато под капотом появилась «архитектура приложения». Теперь есть куда добавлять новые фишки.",
      "date": "2017-09-02",
      "header": "Привет"
    },
    {
      "id": 3,
      "content": "Нет, я не забросил дело.",
      "date": "2018-01-27",
      "header": "Привет"
    },
    {
      "id": 4,
      "content": "В детстве я мало думал о далеких странах. И географию считал одним из скучнейших предметов (да и преподавали нам ее абы как). Но в один знаменательный вечер, между егэ и поступлением в вуз, меня проняло. Без особых причин я стал мечать, как объезжу весь мир, соображал, проще ли наняться матросом или устроиться военным кореспондентом, потому-что ни на какие финансы я тогда не мог и расчитывать. Весь вечер я смотрел на карту мира и, вдохновленный, вычерчивал замысловатые маршруты. К утру я все забыл, вернулся к насущным абитуриентским делам и в итоге стал студентом, а не матросом. \n\n>Ни нежность к сыну, ни перед отцом  \nСвященный страх, ни долг любви спокойный  \nБлиз Пенелопы с радостным челом  \nНе возмогли смирить мой голод знойный  \nИзведать мира дальний кругозор  \nИ все, чем дурны люди и достойны.  \n\n>&mdash;Данте, «Божественная комедия»\n\n",
      "date": "2018-03-04",
      "header": "Привет"
    },
    {
      "id": 5,
      "content": "Частота написания в блог поразительна! И это только начало",
      "date": "2018-07-19",
      "header": "Привет"
    }
  ]
}
